Revit 2026 API

# ParameterTypeIdRbsEnergyAnalysisSurfaceAdjacentSpaceId1 Property

---

"Adjacent Space Id (1)"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId RbsEnergyAnalysisSurfaceAdjacentSpaceId1 { get; }
```
```vb
Public Shared ReadOnly Property RbsEnergyAnalysisSurfaceAdjacentSpaceId1 As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ RbsEnergyAnalysisSurfaceAdjacentSpaceId1 {
	ForgeTypeId^ get ();
}
```
```fsharp
static member RbsEnergyAnalysisSurfaceAdjacentSpaceId1 : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace